[
  {
    "id": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/1QB5d11/pngwing-1.jpg",
    "review":"To Kill a Mockingbird is a timeless classic that delves deep into the complexities of morality, justice, and racism in the American South. Harper Lee's masterful storytelling and vivid characters, such as Atticus Finch and Scout, resonate with readers of all ages. Through Scout's innocent yet perceptive eyes, we witness the injustices and prejudices that plague society, challenging us to confront our own beliefs and biases. This powerful novel continues to captivate audiences worldwide, reminding us of the importance of empathy, compassion, and standing up for what is right.",
    "totalPages": 281,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Drama", "Social Issues"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/HtgTWYj/kindpng-1064993.jpg",
    "review":  "1984 is a dystopian masterpiece that serves as a chilling warning against the dangers of totalitarianism and the erosion of individual freedom. George Orwell's prophetic vision of a surveillance state, ruled by omnipresent Big Brother, remains hauntingly relevant in today's digital age. Through the eyes of protagonist Winston Smith, we are plunged into a world where truth is malleable, dissent is punished, and thought is controlled. Orwell's stark portrayal of oppression and thought manipulation serves as a stark reminder of the fragility of democracy and the importance of vigilance in safeguarding our liberties.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/KbfNvJY/kindpng-7318921.jpg",
    "review": "The Great Gatsby is a mesmerizing tale of love, ambition, and the pursuit of the American Dream set amidst the extravagance of the Jazz Age. F. Scott Fitzgerald's lyrical prose and vivid imagery transport readers to the opulent world of Jay Gatsby, a mysterious millionaire who longs to reclaim his lost love, Daisy Buchanan. Through the eyes of narrator Nick Carraway, we are drawn into a world of glamour and illusion, where the pursuit of wealth and status leads to tragedy and disillusionment. The Great Gatsby stands as a timeless critique of the emptiness of materialism and the fleeting nature of happiness.",
    "totalPages": 180,
    "rating": 4.6,
    "category": "Classic",
    "tags": ["Romance", "Roaring Twenties"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "id": 4,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/sPPP7dZ/kindpng-2193744-1.jpg",
    "review": "Harry Potter and the Philosopher's Stone is a spellbinding introduction to the enchanting world of Hogwarts School of Witchcraft and Wizardry. J.K. Rowling's imaginative storytelling, richly drawn characters, and captivating plot whisk readers away on an unforgettable adventure filled with magic, friendship, and courage. As Harry discovers his true identity as a wizard and confronts the dark forces that threaten the wizarding world, readers of all ages are entranced by the wonders of Rowling's imagination. The first installment in the beloved series, Harry Potter and the Philosopher's Stone, sets the stage for an epic journey that will capture the hearts of generations to come.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Coming of Age"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "id": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/pJv4j6J/kindpng-81724-1.jpg",
    "review": "The Catcher in the Rye is a poignant exploration of teenage angst, alienation, and the search for identity in a world filled with phoniness and hypocrisy. J.D. Salinger's iconic protagonist, Holden Caulfield, rebels against the superficiality of society as he grapples with loss, disillusionment, and the transition to adulthood. Through Holden's candid and irreverent voice, Salinger captures the essence of adolescence with honesty and compassion, resonating with readers who have felt the pangs of growing up. The Catcher in the Rye remains a timeless coming-of-age classic that continues to inspire readers to embrace authenticity and defy societal expectations.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Literary Fiction",
    "tags": ["Young Adult", "Existentialism"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "id": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/6sh6gKB/kindpng-4022054-1.jpg",
    "review": "Pride and Prejudice is a timeless romance that transcends the boundaries of time and social class, capturing the hearts of readers with its wit, charm, and unforgettable characters. Jane Austen's keen observation of human nature is on full display as she navigates the complexities of love, marriage, and societal expectations in Regency-era England. Through the spirited Elizabeth Bennet and the enigmatic Mr. Darcy, Austen crafts a tale of misunderstandings, second chances, and the transformative power of love. Pride and Prejudice remains a beloved classic that continues to enchant readers with its enduring themes of integrity, forgiveness, and the triumph of true love.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Romance",
    "tags": ["Regency", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "id": 7,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/NjfWLLL/kindpng-4945926-1.jpg",
    "review": "The Hobbit is a captivating adventure that transports readers to the enchanting world of Middle-earth, where dwarves, wizards, and dragons collide in an epic quest for treasure and glory. J.R.R. Tolkien's timeless tale follows the reluctant hero Bilbo Baggins as he embarks on a perilous journey to reclaim the Lonely Mountain from the fearsome dragon Smaug. Through Bilbo's encounters with Gollum, Smaug, and the elves of Mirkwood, readers are swept up in a tale of courage, friendship, and the triumph of the unexpected. Tolkien's richly imagined world, filled with vibrant landscapes and captivating creatures, has enthralled generations of readers, cementing The Hobbit's status as a beloved classic of fantasy literature.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "id": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/wsFvvY8/kindpng-2592315-1.jpg",
    "review": "The Alchemist is a mesmerizing fable that explores the journey of self-discovery, destiny, and the pursuit of one's dreams. Paulo Coelho's allegorical tale follows Santiago, a young shepherd who embarks on a transformative quest to find his Personal Legend. As Santiago encounters various mentors and obstacles along the way, he learns valuable lessons about following his heart, embracing the unknown, and finding meaning in the journey itself. Coelho's lyrical prose and profound insights into the human spirit resonate with readers around the world, inspiring them to pursue their own dreams with courage and perseverance.",
    "totalPages": 208,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "id": 9,
    "bookName": "The Lord of the Rings: The Fellowship of the Ring",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/5BKB7Zt/kindpng-5624060-1.jpg",
    "review": "The Fellowship of the Ring is the epic beginning of J.R.R. Tolkien's monumental saga, The Lord of the Rings. Set in the enchanting world of Middle-earth, the story follows Frodo Baggins and his companions as they embark on a perilous quest to destroy the One Ring and defeat the dark lord Sauron. From the peaceful Shire to the treacherous lands of Mordor, Tolkien weaves a tapestry of adventure, friendship, and sacrifice that captivates readers from the first page to the last. Filled with memorable characters, breathtaking landscapes, and epic battles, The Fellowship of the Ring is a timeless masterpiece that continues to enchant readers of all ages.",
    "totalPages": 398,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  }
]
